{"author": "Pierre Barreau", "body": "Cerca de dois anos e meio atrás,\neu assisti a um filme chamado \"Ela\", que é sobre Samantha,\numa superinteligência artificial que não pode tomar forma física. E porque ela não pode\naparecer em fotografias, Samantha decide escrever\numa composição musical que capturasse um momento da sua vida,\nassim como uma fotografia o faria. \n Como músico, engenheiro e criado\nem uma família de artistas, achei essa ideia de fotografias musicais\nrealmente poderosa. Assim, decidi criar\numa inteligência artificial compositora. Seu nome é AIVA, e ela é\numa inteligência artificial que tem aprendido\na arte da composição musical lendo mais de 30 mil\ndas maiores partituras da história. Aqui está como uma partitura\nse parece para o algoritmo numa representação no estilo da matriz. E aqui está o que 30 mil partituras, escritas por compositores\ncomo Mozart e Beethoven, se parece num único quadro. \n Então, usando redes neurais profundas,\nAIVA procura padrões nas partituras. Partindo de alguns compassos\nde uma música existente, ela tenta deduzir\nquais serão as próximas notas. Quando AIVA passa a fazer boas previsões, ela pode construir um conjunto\nde regras matemáticas para determinado estilo de música para poder criar\nsuas próprias composições. \n E de certa forma, isso é meio como nós,\nhumanos, compomos música também. É um processo de tentativa e erro, durante o qual nem sempre conseguimos\na nota certa o tempo todo, mas podemos nos corrigir, seja com nosso ouvido ou\ncom nosso conhecimento musical. Mas para AIVA, esse processo\né tirado de décadas de aprendizado de um músico e compositor\nem apenas poucas horas. \n Mas a música também é\numa arte muito subjetiva. E precisávamos ensinar AIVA como compor a música certa\npara a pessoa certa, porque as pessoas têm\npreferências diferentes. Para tal, mostramos ao algoritmo\nmais de 30 categorias diferentes para cada partitura\nem nosso banco de dados. Essas categorias são como humor ou intensidade da nota\nou estilo do compositor ou a época em que foi escrita. E vendo todos esses dados, AIVA pode realmente responder\na pedidos muito específicos. \n Por exemplo, tivemos\num projeto recentemente, em que nos foi solicitado\ncriar uma composição que lembrasse uma trilha sonora\nde um filme de ficção científica. A composição criada chama-se\n\"Among the Stars\" e foi gravada pela Orquestra CMG, em Hollywood,\nsob a regência do maestro John Beal, e isso é o que foi gravado,\numa composição escrita por AIVA. \n (Música) \n (Fim da música) \n O que acham? \n (Aplausos) \n Obrigado. \n Como podem ver, IA pode criar\ncomposições lindas e a melhor parte é que humanos\npodem dar vida a elas. Não é a primeira vez na história que tecnologia foi capaz\nde ampliar a criatividade humana. Música ao vivo era sempre\nutilizada em filmes mudos para acrescentar à experiência. \n O problema da música ao vivo\né que ela era limitada. É complicado colocar uma orquestra inteira\nem um cinema pequeno, e é difícil fazer isso\npara todos cinemas do mundo. Assim, a invenção de gravadores permitiu aos criadores de conteúdo,\ncomo criadores de filme, ter a música gravada adaptada\na cada cena de suas histórias. E isso foi realmente\num potenciador da criatividade. \n Dois anos e meio atrás,\nquando assistia o filme \"Ela\", pensei que música personalizada seria a próxima grande mudança\nem como consumimos e criamos música. Porque hoje em dia temos\nconteúdo interativo, como videogames, que têm centenas de horas de jogo, mas apenas duas horas de música, em média. Isso significa que a música se repete\nvárias vezes e não é muito envolvente. Então, estamos trabalhando\npara garantir que IA possa compor centenas de horas de música personalizada para situações fora da capacidade humana. \n E não queremos fazer\nisso apenas para jogos. Beethoven escreveu uma composição\npara a amada dele chamada \"Für Elise\", e imaginem se pudéssemos\ntrazer Beethoven de volta à vida. Como se ele estivesse sentado ao seu lado,\ncompondo uma música para sua personalidade e para sua história de vida. \n Ou imaginem se alguém\ncomo Martin Luther King, tivesse uma AI compositora personalizada. Talvez lembraríamos de \"I Had a Dream\"\nnão apenas como um grande discurso, mas também como uma grande composição\nde parte de nossa história, capturando os ideais do Dr. King. \n Esta é a nossa visão de AIVA: personalizar a música\nde tal forma que todos vocês, e todos indivíduos no mundo, possam ter acesso a uma trilha sonora\nao vivo personalizada, baseada em sua história e personalidade. Esse momento juntos aqui no TED\nagora faz parte da nossa história de vida. Então, pareceu apropriado que a AIVA\ncompusesse uma música para esse momento. E é exatamente isso que fizemos. Induzimos AIVA a compor uma música\nno estilo do jingle do TED e no estilo de música que nos causa\num sentimento de admiração. E a composição é chamada\nde \"Age of Amazement\". Não foi necessária IA para criar tal nome. \n (Risos) \n Eu não poderia estar mais orgulhoso\nde mostrá-la a vocês, então, fechem os olhos\ne aproveitem a música. \n Muito obrigado. \n (Música) \n [The Age of Amazement - composta por AIVA] \n (Fim da música) \n Ela foi dedicada a todos vocês. \n Obrigado. \n (Aplausos) \n", "title": "Como IA poderia compor uma trilha sonora para sua vida", "type": "video", "url": "https://www.ted.com/talks/pierre_barreau_how_ai_could_compose_a_personalized_soundtrack_to_your_life/transcript?language=pt-br"}