{"author": "Tom Gruber", "body": "Estou aqui para oferecer a vocês\num novo olhar sobre a área em que atuo: a inteligência artificial. Acho que o propósito da IA é capacitar o homem\ncom a inteligência da máquina. À medida que as máquinas\nficam mais inteligentes, nós também ficamos. Chamo isso de \"IA humanística\", inteligência artificial projetada\npara atender às necessidades humanas aprimorando as pessoas\ne colaborando com elas. Fico feliz em ver que a ideia\nde um assistente inteligente é a tendência atual. É a metáfora popularmente aceita\npara a interface entre o homem e a IA. A IA que ajudei a criar chama-se Siri. \n Vocês conhecem a Siri. A Siri conhece nossas intenções\ne nos ajuda a realizá-las, nos ajuda a fazer coisas. Mas talvez não saibam\nque projetamos a Siri como uma IA humanística, para aprimorar as pessoas\ncom uma interface de comunicação, que permitiu a elas\nusar a computação móvel, independentemente de quem fossem\ne das capacidades que tivessem. \n Para a maioria de nós,\no impacto dessa tecnologia é tornar as coisas mais fáceis de usar. Mas, para meu amigo Daniel, o impacto da IA nesses sistemas\nmudou a vida dele. Daniel é muito sociável, e ele é cego e tetraplégico, o que dificulta o uso desses aparelhos\nque fazem parte do nosso cotidiano. Em minha última visita,\no irmão dele disse: \"Espere, ele não está pronto. Daniel está no telefone\ncom uma mulher que conheceu on-line\". Pensei: \"Que legal! Como ele conseguiu?\" Daniel usa a Siri\npara gerenciar sua vida social, e-mails, mensagens de texto e telefone, sem depender de seus cuidadores. Interessante, não é mesmo? É uma grande ironia: um homem cuja relação com a IA o ajuda a se relacionar\ncom pessoas de verdade. Isso é a IA humanística. \n Outro exemplo de algo\nque pode mudar uma vida é o diagnóstico de câncer. Quando um médico suspeita de câncer,\nextrai uma amostra e envia ao patologista, que a observa no microscópio. Os patologistas examinam\ncentenas de lâminas e milhões de células todos os dias. Para ajudar nessa tarefa, alguns pesquisadores\ncriaram um classificador com IA. O classificador diz:\n\"Isso é câncer ou não?\", examinando as imagens. O classificador era muito bom, mas não tão bom quanto um ser humano, que acerta na maioria das vezes. \n Mas, quando combinaram as capacidades\nda máquina com as do homem, o nível de precisão foi para 99,5%. Essa parceria com a IA\neliminou 85% dos erros que um patologista humano\nteria feito se trabalhasse sozinho. São muitos casos de câncer\nque não teriam sido tratados. Por curiosidade, o homem foi melhor\nna rejeição de falsos positivos, e a máquina no reconhecimento\nde casos difíceis de detectar. Mas a lição aqui\nnão é sobre qual é o melhor nessa tarefa de classificação de imagens. Isso muda todos os dias. A lição aqui é que, ao combinar\nas capacidades do homem com as da máquina, foi criada uma parceria\nde desempenho sobre-humano. Isso é a IA humanística. \n Vejamos um outro exemplo com desempenho turbinado. O design. Vamos supor que vocês são engenheiros, e querem criar um novo\ndesign para um \"drone\". Pegam as ferramentas de software\npreferidas de vocês, inserem o formato e os materiais,\ne analisam o desempenho. Isso lhes fornece um design. Se derem as mesmas ferramentas a uma IA, ela poderá gerar milhares de designs. \n Este vídeo da Autodesk é incrível. Isso é real. Isso transforma a maneira\ncomo fazemos o design. O engenheiro humano informa\no que o design deve conquistar, e a máquina informa:\n\"As possibilidades são estas\". O trabalho do engenheiro é escolher aquela que atende\nmelhor aos objetivos do design, o que, como humano,\nconhece melhor do que ninguém, usando a capacidade e o julgamento humano. Neste caso, a forma eleita se parece\ncom algo projetado pela natureza, sem alguns milhões de anos de evolução e todo aquele pelo desnecessário. \n Vamos ver aonde essa ideia\nda IA humanística nos leva se especularmos um pouco mais. Que tipo de melhoria\ntodos nós gostaríamos de ter? Que tal o aprimoramento cognitivo? Em vez de perguntarmos: \"Podemos tornar\nas máquinas inteligentes?\", perguntemos: \"Nossas máquinas\npodem nos tornar inteligentes?\" Considerem a memória, por exemplo. A memória é a base da inteligência humana. Mas a memória humana\né famosa pelas falhas. Somos ótimos em contar histórias,\nmas não nos apegamos aos detalhes. Além disso, nossas memórias \nse enfraquecem com o tempo. Para onde foram os anos 60?\nTambém posso ir até lá? \n (Risos) \n E se pudessem ter uma memória\ntão boa quanto a de um computador, e que fosse sobre a vida de vocês? E se pudessem se lembrar de todas\nas pessoas que já conheceram, da pronúncia dos nomes delas, dos detalhes de família, dos esportes\nfavoritos, da última conversa? Se tivessem essa memória\npor toda a vida de vocês, poderiam deixar a IA examinar todas as interações\nque já tiveram com as pessoas, e ajudá-los a refletir\nsobre seus relacionamentos. E se a IA pudesse ler\ntudo o que vocês já leram, e ouvir cada música que já ouviram? Ela poderia ajudá-los a recuperar,\nnos mínimos detalhes, qualquer coisa que já tenham\nlido ou ouvido antes. Imaginem o que isso faria pela capacidade\nde criar novas relações e novas ideias. \n E nossos corpos? E se pudéssemos nos lembrar\ndas consequências de tudo o que comemos, de cada pílula que tomamos, de cada noite que não dormimos? Criaríamos nossa própria ciência\ncom nossos próprios dados sobre o que nos faz\nsentir bem e ficar saudáveis. Imaginem como isso iria revolucionar a maneira como lidamos\ncom alergias e doenças crônicas. \n Acredito que a IA tornará realidade\no aprimoramento da memória pessoal. Não sei dizer quando\nou quais os fatores envolvidos, mas acho que é inevitável, porque tudo que faz \nda IA um sucesso atualmente, a disponibilidade de dados abrangentes e a capacidade das máquinas \nde entender esses dados, podem ser aplicadas\naos dados de nossa vida. Esses dados estão aqui hoje,\ndisponíveis para todos nós, porque levamos uma vida\ncom intervenção digital no celular e on-line. \n Na minha opinião, uma memória\npessoal é uma memória privada. Temos a chance de escolher\no que será ou não lembrado e retido. É absolutamente necessário\nque isso seja mantido em segurança. \n Para a maioria de nós, o impacto do aprimoramento\nde nossa memória pessoal será um ganho mental imenso, talvez, com sorte,\num pouco mais de estilo social. Mas, para os milhões que sofrem\nde Alzheimer e demência, o aprimoramento da memória\npode ser a diferença entre uma vida de isolamento e uma vida de dignidade e relacionamento. \n Neste momento, estamos no meio\nde um renascimento da IA. Somente nos últimos anos, começamos a ver soluções\npara os problemas de IA com os quais lutamos\nliteralmente há décadas: compreensão de linguagem, texto e imagem. Temos uma escolha sobre o modo\ncomo utilizamos essa poderosa tecnologia. Podemos escolher utilizar a IA\npara automatizar e competir conosco, ou para nos aprimorar e colaborar conosco, para superar nossas limitações cognitivas e para nos ajudar a fazer o que quisermos, mas de uma forma melhor. Conforme descobrimos novas formas\nde dar inteligência às máquinas, podemos distribuir essa inteligência\na todos os assistentes de IA no mundo e, portanto, para cada pessoa,\nindependentemente das circunstâncias. Por esse motivo, cada vez que uma máquina\nfica mais inteligente, nós ficamos mais inteligentes. \n Essa é uma IA que vale a pena divulgar. \n Obrigado. \n (Aplausos) \n Obrigado. \n (Aplausos) \n", "title": "Como a inteligência artificial pode melhorar nossa memória, nosso trabalho e nossa vida social.", "type": "video", "url": "https://www.ted.com/talks/tom_gruber_how_ai_can_enhance_our_memory_work_and_social_lives/transcript?language=pt-br"}